common/models/Properties.php

SELECT * FROM `propertyphoto` WHERE `propertyid`=43002
---
    public function getOnePropertyPhoto($propertyid)
    {
        //return $this->hasMany(Propertyphoto::className(),['propertyid', 'propertyid']);
        //echo "<pre>";
        $model = Propertyphoto::find()->where(['propertyid' => $propertyid])->one();