common/models/Users.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `users` WHERE (`id`=11) AND (`status`=10)

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `users` WHERE (`email`='vbadheli@gmail.com') AND (`status`=10)