backend/models/AdminUser.php

SELECT * FROM `users` WHERE (`id`=8) AND (`status`=10)
---
	public static function findIdentity($id) {
		return static::findOne ( [
				'id' => $id,
				'status' => self::STATUS_ACTIVE
		] );