backend/models/SignupForm.php

	public function signup() {
		if ($this->validate ()) {
			$user = new AdminUser ();
			$user->username = $this->username;
			$user->email = $this->email;
			$user->setPassword ( $this->password );
			$user->generateAuthKey ();
			if ($user->save ()) {
---
INSERT INTO `users` (`firstname`, `email`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('admin', 'admin@gmail.com', '$2y$13$Xn8coAPC8xG3eB6ZzaoX/uVLKqiSfhj2EcHkUOM5wM.sMccR.SL5i', 'ZpRA4Luz3qkto0_iDo3Ydz2aC7buJ4CO', 1491915244, 1491915244)