frontend/views/site/_form.php

SELECT * FROM `states`
---
    <div class="row ">
        <div class="col-md-4 col-sm-4 col-xs-12 margin-bottom20">
        <?php
$states = States::find()->all();